## Desmatamento UF entre 2013 e 2018

In [20]:
import pandas as pd 
import matplotlib.pyplot as plt

%matplotlib inline

In [21]:
df = pd.read_csv('terrabrasilis_legal_amazon_22_7_2019_1566486766885.Estados.csv', encoding='latin', delimiter=',')

In [22]:
df.head()

   year         area          loi
0  2018    78.436338      RORAIMA
1  2018   930.523531     AMAZONAS
2  2018    19.144328    TOCANTINS
3  2018  1186.006134    RONDÃNIA
4  2018  1419.160520  MATO GROSSO

In [23]:
df.tail()

    year         area          loi
48  2013    77.054917    TOCANTINS
49  2013  1105.993186  MATO GROSSO
50  2013  2032.028769        PARÃ
51  2013   197.812387         ACRE
52  2013   293.207690    MARANHÃO

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 3 columns):
year    53 non-null int64
area    53 non-null float64
loi     53 non-null object
dtypes: float64(1), int64(1), object(1)
memory usage: 1.3+ KB

In [25]:
list(df.columns)

['year', 'area', 'loi']

In [26]:
df.rename(columns={'year': 'Ano','area': 'Area_KM', 'loi': 'Estado'}, inplace=True)

In [27]:
df.head()

    Ano      Area_KM       Estado
0  2018    78.436338      RORAIMA
1  2018   930.523531     AMAZONAS
2  2018    19.144328    TOCANTINS
3  2018  1186.006134    RONDÃNIA
4  2018  1419.160520  MATO GROSSO

## Desmatamento - Ano x Area por KM2

In [28]:
AnosGroups = df.groupby("Ano")["Area_KM"].sum().reset_index()

In [29]:
AnosGroups.sort_values(by= "Ano", ascending=False).head(13)

    Ano      Area_KM
5  2018  6782.877091
4  2017  7077.098156
3  2016  7227.081955
2  2015  6053.467776
1  2014  5073.163738
0  2013  5307.470682

In [34]:
# Total de KM2 desmatados em 5 anos
df['Area_KM'].sum()

37521.15939802245

## Estados mais desmatados por KM2

In [30]:
EstadoGroups = df.groupby("Estado")["Area_KM"].sum().reset_index()

In [31]:
EstadoGroups.sort_values(by= "Area_KM", ascending=False)

        Estado       Area_KM
5        PARÃ  13929.345412
4  MATO GROSSO   8106.156759
6    RONDÃNIA   6317.631531
2     AMAZONAS   4635.329435
0         ACRE   1763.147125
3    MARANHÃO   1476.421080
7      RORAIMA    914.506649
8    TOCANTINS    278.092624
1       AMAPÃ    100.528783